EDT/ZUP/zup_edt/src/Catalogs/кдНастройкиИнтеграции/кдНастройкиИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кдНастройкиИнтеграции</name>
  <attributes>
    <name>ПутьОпределенияВебСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>URIПространстваИменСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочкиПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДопПараметры</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/ZUP/zup_edt/src/Catalogs/кдНастройкиИнтеграции/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПослеВводаСтрокиПродолжить(НовыйПароль, Параметры) Экспорт
	Если НЕ НовыйПароль = Неопределено Тогда
		ТекОбъект = Объект.Ссылка.ПолучитьОбъект();
        ТекОбъект.Пароль = Новый ХранилищеЗначения(НовыйПароль);
		ТекОбъект.Записать();
		ОбновитьЗаданностьПароля();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаданностьПароля()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекОбъект = Объект.Ссылка.ПолучитьОбъект();
	
		ТекПароль = ТекОбъект.ПолучитьПароль();
		локПароль = ?(НЕ ЗначениеЗаполнено(ТекПароль),"не задан","задан");
	Иначе
		локПароль = "не задан";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ОбновитьЗаданностьПароля();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПроверитьПрава() Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"Не достаточно прав");
	Иначе
		ПриОткрытииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьПрава()
	Возврат НЕ РольДоступна("ПолныеПрава");
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Дубли = ПроверитьДублиВТЗ();
	Если НЕ ПустаяСтрока(Дубли) Тогда
		ПоказатьПредупреждение(, "имеются дубли в дополнительных параметрах");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьДублиВТЗ()
	Результат = "";
	КЧ = Новый КвалификаторыЧисла(10,0);
	ОписаниеЧисло = Новый ОписаниеТипов("Число",,,КЧ);
	
	тзДубли = Объект.ДопПараметры.Выгрузить();
	тзДубли.Колонки.Добавить("Колво", ОписаниеЧисло);
	тзДубли.ЗаполнитьЗначения(1,"Колво");
	тзДубли.Свернуть("Параметр","Колво");
	Для каждого ТекСтрока Из тзДубли Цикл
		Если ТекСтрока.Колво<2 Тогда
			Продолжить;
		КонецЕсли;
	Результат = ?(ПустаяСтрока(Результат), ТекСтрока, ", " + ТекСтрока) ;
	КонецЦикла;

	Возврат Результат;
КонецФункции


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры


&НаКлиенте
Процедура ПарольАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НовыйПароль = "";
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПослеВводаСтрокиПродолжить", ЭтотОбъект, Параметры), НовыйПароль, "Введите новый пароль");
КонецПроцедуры
